#include <stdio.h>
#include <string.h>

int main()
{
    char text[81], *p;
    // 正则写法，读入一行：读入内容，直到遇到换行符 \n 为止
    scanf("%[^\n]", text);

    // printf("-输入：%s, len=%lu\n", text, strlen(text));

    for (p = text + strlen(text) - 1; p >= text; p--)
    {
        if (*(p - 1) == ' ')
        {
            // printf("-输出：{1}\n");
            printf("%s ", p);
        }
        if (p == text)
        {
            // printf("-输出：{2}\n");
            printf("%s", p);
        }
        if (*p == ' ')
        {
            // printf("-输出：{3}\n");
            *p = '\0';
        }
        // printf("-输出：p=\"%s\"\n", p);
    }

    // printf("-输出：%s, len=%lu\n", text, strlen(text));

    return 0;
}

/*
输入：
Hello World Here I Come

输出：
Come I Here World Hello

解题思路：
- 使用正则写法，将字符串读入到字符串变量 text 中
- 逆序遍历访问字符串，初始将字符串变量的起始地址赋值给自定义的指针 p（使用星号 * 可以访问指针所处地址的变量）
    - 当下一轮要访问的字符是空格时（即指针 p 的前一个地址： *(p - 1) == ' '），输出指针 p（即指针 p 所处地址 ～ 字符串末尾（\0）的字符串内容）和一个空格
    - 当指针的 p 的地址与字符串变量 text 的地址相等时（表示访问到字符串的起始地址了），输出指针 p 不带空格
    - 每轮遍历末尾检查，如果 *p 是空格，则将 *p 赋值为 '\0'，表示是字符串变量 text 新的末尾（'\0' 起分割作用）

遇到的问题：
- 设想通过 while 循环 scanf，读入单词并保存在特定的 struct 结构体中，最后逆序遍历并输出结构体中保存的单词列表，太繁琐

收获：
- 看题解学到可以基于指针、地址，字符串结束符（'\0'）的综合运用来解题
- 学到可以使用 %[^\n] 读入一行数据
- 学到指针可以通过运算的方式（p--），移动访问各个地址上的变量（*p）
- 学到一连串的字符串地址中，可以使用 '\0' 来分割字符串
*/